greeting =''', привет! Это игра КОНФЕТЫ! 🍬🍬🍬🍭🍭🍭
Для начала новой игры нажми команду: /new_game
Для выбра уровня сложности нажми команду: /level (смена при повторном нажатии)
(Hard -умный Бот 🤓, Light - тупень 🙃) 
Правила: На столе лежит 150 конфет.
Играют два игрока делая ход друг после друга. Первый ход определяется рандомно.
За один ход можно забрать не более чем 28 конфет. 
Выигрывает, тот, кто сделает последний ход и заберет осташиеся на столе конфетки.
Доступны команды:
/stop_game - досрочно закончить игру.
/set_total - выбор МАХ имеющегося кол-ва конфет (например /set_total 300).
'''